In [114]:
import numpy as np

In [115]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [116]:
import pandas as pd

#SERIES THROUGH LISTS

In [4]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

#SERIES THROUGH NUMPY ARRAY

In [5]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

#GIVING INDEX FROM OUR OWN END

In [6]:
pd.Series(index= ['Eshant','Pranjal','Jayesh','Ashish'],data=[1,2,3,4])

Eshant     1
Pranjal    2
Jayesh     3
Ashish     4
dtype: int64

#series through dictionary values

In [7]:
steps={'day1':4000,'day2':3000,'day3':12000}
pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

#Using repeat function along with creating a series

In [8]:
pd.Series(3).repeat(5).reset_index()

   index  0
0      0  3
1      0  3
2      0  3
3      0  3
4      0  3

In [9]:
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

#AGGREGATE FUNCTION ON PANDA SERIES

In [10]:
sr=pd.Series([1,2,3,4,5,6,7])
sr.agg([min,max,sum])

C:\Users\Admin\AppData\Local\Temp\ipykernel_1176\1409269523.py:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
C:\Users\Admin\AppData\Local\Temp\ipykernel_1176\1409269523.py:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
C:\Users\Admin\AppData\Local\Temp\ipykernel_1176\1409269523.py:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

#SERIES ABSOLUTE FUNCTION

In [11]:
sr=pd.Series([1,-2,3,-4,5,-6,7])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

#APPENDING SERIES

In [12]:
sr1=pd.Series([1,-2,3,-4,5,-6,7])
sr2=pd.Series([1,2,3,4,5,6,7])
sr1

0    1
1   -2
2    3
3   -4
4    5
5   -6
6    7
dtype: int64

In [13]:
sr2

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

#ASTYPE FUNCTION

In [14]:
type(sr1[1])

numpy.int64

In [15]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
3   -4.0
4    5.0
5   -6.0
6    7.0
dtype: float64

#Between function

In [16]:
sr1=pd.Series([1,2,3,4,5,6,7,8,9,20])
sr1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [17]:
ser=pd.Series(['Aryan Tiwari','Data Science','Geeks for geeks','Hello World','Machine Learning'])

#Upper and lower function

In [18]:
ser.str.upper()

0        ARYAN TIWARI
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object

In [19]:
ser.str.lower()

0        aryan tiwari
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [20]:
#LENGTH FUNCTION

In [21]:
ser=pd.Series(['Aryan Tiwari','Data Science','Geeks for geeks','Hello World','Machine Learning'])
for i in ser:
    print(i,len(i))

Aryan Tiwari 12
Data Science 12
Geeks for geeks 15
Hello World 11
Machine Learning 16

In [22]:
#STRIP FUNCTION

ser=pd.Series(['Aryan Tiwari','Data Science','Geeks for geeks','Hello World','Machine Learning'])

ser=ser.str.strip()
for i in ser:
    print(i,len(i))

In [23]:
ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [24]:
ser.str.startswith('D')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [25]:
ser.str.endswith('i')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [26]:
ser.str.endswith('s')

0    False
1    False
2     True
3    False
4    False
dtype: bool

#CONVERTING SERIES TO LISTS

In [27]:
ser.to_list()

['Aryan Tiwari',
 'Data Science',
 'Geeks for geeks',
 'Hello World',
 'Machine Learning']

#CREATING DATA FRAMES

In [28]:
lst=['Geeks','For','Geeks','is','portal','for','Geeks']
pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [29]:
lst=[['tom',10],['jerry',12],['spike',14]]
pd.DataFrame(lst)

       0   1
0    tom  10
1  jerry  12
2  spike  14

In [30]:
data={'name':['Tom','Krish','Spiderman'],'age':[67,45,19]}
pd.DataFrame(data)

        name  age
0        Tom   67
1      Krish   45
2  Spiderman   19

In [31]:
data={'Name':['Jai','Kishan','Gaurav'],
      'Age':[18,19,20],
      'Address':['Bhopal','Bina','Guna'],
      'Qualification':['Btech','BBA','MCA']}
df=pd.DataFrame(data)
df[['Name','Qualification']]

     Name Qualification
0     Jai         Btech
1  Kishan           BBA
2  Gaurav           MCA

#SLICING IN DATAFRAME USING ILOC AND LOC

In [32]:
data={'one':pd.Series([1,2,3,4]),
      'two':pd.Series([10,20,30,40]),
      'three':pd.Series([100,200,300,400]),
      'four':pd.Series([1000,2000,3000,4000])}
df=pd.DataFrame(data)

In [33]:
df.loc[1:2]

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000

In [34]:
df.loc[1:2,'three':'four']

   three  four
1    200  2000
2    300  3000

#COLUMN ADDITION

In [35]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [36]:
l=[22,33,44,55]
df['Five']=l
df

   one  two  three  four  Five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [37]:
sr=pd.Series([222,323,434,555])
df['six']=sr
df

   one  two  three  four  Five  six
0    1   10    100  1000    22  222
1    2   20    200  2000    33  323
2    3   30    300  3000    44  434
3    4   40    400  4000    55  555

In [38]:
del df['six']
df

   one  two  three  four  Five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

#TRANSPOSE OF COLUMN

In [39]:
data={'one':pd.Series([1,2,3,4]),
      'two':pd.Series([10,20,30,40]),
      'three':pd.Series([100,200,300,400]),
      'four':pd.Series([1000,2000,3000,4000])}
df=pd.DataFrame(data)

In [40]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

In [41]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [42]:
df.ndim

2

In [43]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [44]:
df.shape

(4, 4)

HEAD() FUNCTION

In [45]:
d={'Name':pd.Series(['Tom','Jerry','Popeye','Olive','Bluto','Mickey']),
   'Age': pd.Series([10,12,14,30,28,33]),
   'Height':pd.Series([5.2,6.1,5,4,7,6.2])}
df=pd.DataFrame(d)
df

     Name  Age  Height
0     Tom   10     5.2
1   Jerry   12     6.1
2  Popeye   14     5.0
3   Olive   30     4.0
4   Bluto   28     7.0
5  Mickey   33     6.2

In [46]:
df.head()

     Name  Age  Height
0     Tom   10     5.2
1   Jerry   12     6.1
2  Popeye   14     5.0
3   Olive   30     4.0
4   Bluto   28     7.0

In [47]:
df.tail()

     Name  Age  Height
1   Jerry   12     6.1
2  Popeye   14     5.0
3   Olive   30     4.0
4   Bluto   28     7.0
5  Mickey   33     6.2

In [48]:
df.sum

<bound method DataFrame.sum of      Name  Age  Height
0     Tom   10     5.2
1   Jerry   12     6.1
2  Popeye   14     5.0
3   Olive   30     4.0
4   Bluto   28     7.0
5  Mickey   33     6.2>

#MODE

In [49]:
de=pd.DataFrame({'A':[1,2,2,3,4,4,4,5],'B':[10,20,20,30,40,40,50,60]})
print('A',de['A'].mode() )

A 0    4
Name: A, dtype: int64

In [50]:
de.var()

A      1.839286
B    283.928571
dtype: float64

In [51]:
de.std()

A     1.356203
B    16.850180
dtype: float64

#DESCRIBE FUCTION

In [52]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000]),
      'five':pd.Series(['A','B','C','D'])}
df=pd.DataFrame(data)
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

APPLYY FUNCTION

In [53]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000]),
      'five':pd.Series(['A','B','C','D'])}


df=pd.DataFrame(data)
df

   one  two  three  four five
0    1   10    100  1000    A
1    2   20    200  2000    B
2    3   30    300  3000    C
3    4   40    400  4000    D

In [54]:
df=pd.DataFrame({ 'A':[1.2,3.4,5.6],
                'B':[7.8,9.1,2.3]})
df_1=df.applymap(np.int64)
print(df_1)
df_2=df.apply(lambda row: row.mean(),axis = 0)
print(df_2)


df_2=df_1.apply(lambda row: row.mean(),axis = 0)
print(df_2)

   A  B
0  1  7
1  3  9
2  5  2
A    3.4
B    6.4
dtype: float64
A    3.0
B    6.0
dtype: float64

C:\Users\Admin\AppData\Local\Temp\ipykernel_1176\3501666924.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_1=df.applymap(np.int64)

#RENAME FUNCTION

In [55]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000]),
      'five':pd.Series(['A','B','C','D'])}


df=pd.DataFrame(data)
df.rename(columns={'one':'One','two':'Two'}, inplace=True,index={0:'a',1:'b',2:'c',3:'d'})
df

   One  Two  three  four five
a    1   10    100  1000    A
b    2   20    200  2000    B
c    3   30    300  3000    C
d    4   40    400  4000    D

#REINDEX FUNCTION

In [56]:
data={'Name':['John','Jane','Jin','Joan'],'Age':[34,23,12,19],
      'City':['New York','Los Angeles','Chicago','Yuganda']}
df=pd.DataFrame(data)
df.reindex(columns=['Name','City','Age'])

   Name         City  Age
0  John     New York   34
1  Jane  Los Angeles   23
2   Jin      Chicago   12
3  Joan      Yuganda   19

In [57]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000]),
      'five':pd.Series(['A','B','C','D'])}


df=pd.DataFrame(data)
print()
print('-'*45)
print(df.reindex([1,3,0,2]))

---------------------------------------------
   one  two  three  four five
1    2   20    200  2000    B
3    4   40    400  4000    D
0    1   10    100  1000    A
2    3   30    300  3000    C

    #SORTING FUCTION

In [58]:
data={'one':pd.Series([1,51,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000]),
      'five':pd.Series(['A','B','C','D'])}


df=pd.DataFrame(data)
print(df)
df.sort_values(by='one',ascending=True)

   one  two  three  four five
0    1   10    100  1000    A
1   51   20    200  2000    B
2    3   30    300  3000    C
3    4   40    400  4000    D

   one  two  three  four five
0    1   10    100  1000    A
2    3   30    300  3000    C
3    4   40    400  4000    D
1   51   20    200  2000    B

#SORT IN SPECIFIC ORDER BASED ON MULTIPLE COLUMNS

In [59]:
df.sort_values(by=['one'],)

   one  two  three  four five
0    1   10    100  1000    A
2    3   30    300  3000    C
3    4   40    400  4000    D
1   51   20    200  2000    B

#GROUPBY FUNCTION

In [60]:
cricket={'Team':['India','India','Australia','Australia','SA','SA','SA','SA','NZ','NZ','NZ','India'
                ],
         'Rank':[2,3,1,2,3,4,1,1,2,4,1,2],
         'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,801,891,815,776,784,834,824,758,691,883,782]}
df=pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [61]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [62]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [63]:
df.groupby('Team').sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [64]:
df.groupby('Team').sum()['Points'].sort_values(ascending=False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

In [65]:
groups=df.groups('Team')

AttributeError: 'DataFrame' object has no attribute 'groups'

In [ ]:
groups=df.groupby('Team')
groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])

In [ ]:
df.groupby('Team').filter(lambda x: len(x) ==4)

In [ ]:
df.groupby('Team').filter(lambda x: len(x) ==3)

READING CSV

In [68]:
df=pd.read_csv('Football.csv')
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

PANDAS INFO FUNCTION

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     626 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

isnull() function

In [70]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [71]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [73]:
df.describe()

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
25%,14.000000,0.000000,1363.500000,8.000000,6.100000,0.340000,37.750000,17.000000,2.335000,0.980000,2017.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
75%,31.000000,5.000000,2822.000000,14.000000,13.252500,0.570000,86.000000,37.000000,3.382500,1.540000,2019.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [74]:
df['Mins'].quantile(.80)

2915.8

In [75]:
df['Mins'].quantile(.99)

3520.0199999999995

In [76]:
de=df.copy()
df.head(3)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016

In [77]:
de['Year + 100']=de['Year'] + 100
de.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year,Year + 100
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016,2116
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016,2116
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016,2116
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016,2116
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016,2116

VALUE COUNTS FUNCTION

In [82]:
df['Player Names'].value_counts()

Player Names
Andrea Belotti     5
Lionel Messi       5
Luis Suarez        5
Andrej Kramaric    5
Ciro Immobile      5
                  ..
Francois Kamano    1
Lebo Mothiba       1
Gaetan Laborde     1
Falcao             1
Cody Gakpo         1
Name: count, Length: 444, dtype: int64

In [84]:
df['Player Names'].nunique()

444

dropna() function

In [85]:
df.dropna()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
654,Netherlands,Eredivisie,(RZA),Haris Vuckic,23,2,2194,11,6.00,0.26,38,17,1.65,0.74,2020
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [86]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [90]:
df.dropna(inplace=True,axis=1)

In [89]:
df

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
654,Netherlands,Eredivisie,(RZA),Haris Vuckic,23,2,2194,11,6.00,0.26,38,17,1.65,0.74,2020
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [95]:
df.sample(5)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
131,Italy,Serie A,(CAG),Giovanni Simeone,36,2,3157,14,13.29,0.40,107,37,3.22,1.11,2017
441,England,Premier League,(WOL),Raul Jimenez,37,1,3445,17,18.49,0.51,118,43,3.25,1.19,2019
91,Brazil,Campeonato Brasileiro SÃ©rie A,(BOT),Cicero Semedo,35,0,3322,9,9.79,0.28,62,27,1.77,0.77,2016
644,Netherlands,Eredivisie,Tim,Matavz,24,1,2157,12,9.08,0.40,55,28,2.42,1.23,2020
163,Brazil,Campeonato Brasileiro SÃ©rie A,(SAP),Hernanes,19,0,1222,9,5.27,0.41,52,23,4.04,1.79,2017

creating csv file

In [97]:
data={'one':pd.Series([1,2,3,4]),
      'two':pd.Series([10,20,30,40]),
      'three':pd.Series([100,200,300,400]),
      'four':pd.Series([1000,2000,3000,4000])}
df=pd.DataFrame(data)
df.to_csv('Number.csv')

In [101]:
df.to_csv('Numbers.csv',index=False)

Detailed pandas profile

In [120]:
import matplotlib
import pandas_profiling as pp

ModuleNotFoundError: No module named 'pandas_profiling'

In [107]:
df=pd.read_csv('Football.csv')
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [111]:
report=pp.ProfileReport(df)

NameError: name 'pp' is not defined

In [112]:
report

NameError: name 'report' is not defined